pruebas/results/2025-11-10_17-13-27/S0_master_ro_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 315.89 qps: 5054.46 (r/w/o: 4422.47/0.00/631.98) lat (ms,95%): 4.18 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 325.82 qps: 5213.95 (r/w/o: 4562.31/0.00/651.64) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 335.80 qps: 5373.85 (r/w/o: 4702.24/0.00/671.61) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 348.20 qps: 5571.93 (r/w/o: 4875.54/0.00/696.39) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 353.17 qps: 5650.15 (r/w/o: 4943.81/0.00/706.34) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 366.76 qps: 5868.43 (r/w/o: 5134.90/0.00/733.53) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 354.24 qps: 5666.86 (r/w/o: 4958.38/0.00/708.48) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 348.63 qps: 5579.44 (r/w/o: 4882.18/0.00/697.25) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 351.40 qps: 5622.35 (r/w/o: 4919.56/0.00/702.79) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 362.37 qps: 5795.39 (r/w/o: 5070.64/0.00/724.75) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 355.63 qps: 5692.63 (r/w/o: 4981.38/0.00/711.25) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            291970
        write:                           0
        other:                           41710
        total:                           333680
    transactions:                        20855  (347.57 per sec.)
    queries:                             333680 (5561.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0019s
    total number of events:              20855

Latency (ms):
         min:                                    2.45
         avg:                                    2.88
         max:                                   15.72
         95th percentile:                        3.43
         sum:                                59967.08

Threads fairness:
    events (avg/stddev):           20855.0000/0.00
    execution time (avg/stddev):   59.9671/0.00