pruebas/results/2025-11-10_17-13-27/S0_master_ro_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 1271.31 qps: 20348.51 (r/w/o: 17805.10/0.00/2543.41) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 1269.76 qps: 20318.12 (r/w/o: 17778.60/0.00/2539.51) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 1292.82 qps: 20682.26 (r/w/o: 18096.62/0.00/2585.63) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 1270.59 qps: 20328.47 (r/w/o: 17787.29/0.00/2541.18) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 1293.75 qps: 20701.44 (r/w/o: 18113.94/0.00/2587.51) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 1228.63 qps: 19656.20 (r/w/o: 17198.95/0.00/2457.25) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 1277.40 qps: 20443.66 (r/w/o: 17888.85/0.00/2554.81) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 1264.62 qps: 20227.44 (r/w/o: 17698.21/0.00/2529.23) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 1288.60 qps: 20623.35 (r/w/o: 18046.16/0.00/2577.19) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 1197.40 qps: 19152.17 (r/w/o: 16757.38/0.00/2394.80) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 1117.15 qps: 17877.03 (r/w/o: 15642.73/0.00/2234.30) lat (ms,95%): 4.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 1215.04 qps: 19438.66 (r/w/o: 17008.97/0.00/2429.68) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1049146
        write:                           0
        other:                           149878
        total:                           1199024
    transactions:                        74939  (1248.89 per sec.)
    queries:                             1199024 (19982.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0036s
    total number of events:              74939

Latency (ms):
         min:                                    2.74
         avg:                                    3.20
         max:                                   61.74
         95th percentile:                        3.68
         sum:                               239874.92

Threads fairness:
    events (avg/stddev):           18734.7500/35.65
    execution time (avg/stddev):   59.9687/0.00