pruebas/results/2025-11-10_17-13-27/S0_master_ro_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 2251.43 qps: 36034.81 (r/w/o: 31530.36/0.00/4504.45) lat (ms,95%): 4.10 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 2298.62 qps: 36777.09 (r/w/o: 32179.86/0.00/4597.24) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 2345.13 qps: 37523.95 (r/w/o: 32833.68/0.00/4690.27) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 2353.22 qps: 37651.74 (r/w/o: 32945.50/0.00/4706.24) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 2328.78 qps: 37260.76 (r/w/o: 32602.99/0.00/4657.77) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 2334.76 qps: 37359.21 (r/w/o: 32689.68/0.00/4669.53) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 2293.44 qps: 36693.64 (r/w/o: 32106.96/0.00/4586.68) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 2344.72 qps: 37514.29 (r/w/o: 32824.66/0.00/4689.64) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 2295.49 qps: 36730.46 (r/w/o: 32139.48/0.00/4590.98) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 2338.60 qps: 37410.75 (r/w/o: 32733.56/0.00/4677.19) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 2270.71 qps: 36328.98 (r/w/o: 31788.16/0.00/4540.82) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 2282.46 qps: 36520.12 (r/w/o: 31955.00/0.00/4565.11) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1941758
        write:                           0
        other:                           277394
        total:                           2219152
    transactions:                        138697 (2311.36 per sec.)
    queries:                             2219152 (36981.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0055s
    total number of events:              138697

Latency (ms):
         min:                                    1.83
         avg:                                    3.46
         max:                                   30.53
         95th percentile:                        3.96
         sum:                               479738.20

Threads fairness:
    events (avg/stddev):           17337.1250/29.50
    execution time (avg/stddev):   59.9673/0.00