pruebas/results/2025-11-10_17-13-27/S0_master_rw_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 164.55 qps: 3301.76 (r/w/o: 2312.87/658.99/329.90) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 97.60 qps: 1948.10 (r/w/o: 1362.47/390.42/195.21) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 62.80 qps: 1257.53 (r/w/o: 881.55/250.39/125.59) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 68.60 qps: 1368.09 (r/w/o: 956.46/274.42/137.21) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 66.40 qps: 1328.36 (r/w/o: 929.97/265.59/132.80) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 65.00 qps: 1304.39 (r/w/o: 913.59/260.80/130.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 163.40 qps: 3272.73 (r/w/o: 2290.95/654.99/326.79) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 168.61 qps: 3371.36 (r/w/o: 2359.51/674.63/337.22) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 176.39 qps: 3517.45 (r/w/o: 2461.50/703.17/352.79) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 169.00 qps: 3389.39 (r/w/o: 2374.99/676.40/338.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 171.80 qps: 3436.35 (r/w/o: 2404.97/687.79/343.60) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 167.81 qps: 3357.36 (r/w/o: 2349.71/672.03/335.62) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            107996
        write:                           30856
        other:                           15428
        total:                           154280
    transactions:                        7714   (128.54 per sec.)
    queries:                             154280 (2570.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0097s
    total number of events:              7714

Latency (ms):
         min:                                    6.86
         avg:                                   31.11
         max:                                  386.69
         95th percentile:                       77.19
         sum:                               239997.13

Threads fairness:
    events (avg/stddev):           1928.5000/4.72
    execution time (avg/stddev):   59.9993/0.00